
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/15797579098)


<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.claude_lambda_cdk.github_repository_ruleset.this[&#34;main&#34;]
  * module.dialogue_character_system.github_actions_repository_permissions.this[0]
  * module.dialogue_character_system.github_branch.this[&#34;development&#34;]
  * module.dialogue_character_system.github_branch_default.this
  * module.dialogue_character_system.github_branch_protection.this[&#34;development&#34;]
  * module.dialogue_character_system.github_branch_protection.this[&#34;main&#34;]
  * module.dialogue_character_system.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.claude_lambda_cdk.github_repository_ruleset.this["main"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "main"
      + node_id     = (known after apply)
      + repository  = "claude-lambda-cdk"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + deletion                      = false
          + non_fast_forward              = false
          + required_linear_history       = true
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = true
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # module.dialogue_character_system.github_actions_repository_permissions.this[0] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "all"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "dialogue-character-system"
    }

  # module.dialogue_character_system.github_branch.this["development"] will be created
  + resource "github_branch" "this" {
      + branch        = "development"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "dialogue-character-system"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.dialogue_character_system.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "dialogue-character-system"
    }

  # module.dialogue_character_system.github_branch_protection.this["development"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "development"
      + repository_id                   = "dialogue-character-system"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true
    }

  # module.dialogue_character_system.github_branch_protection.this["main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "dialogue-character-system"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.dialogue_character_system.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Generic dialogue character system for creating interactive AI character conversations with 3D animation and voice synthesis"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "dialogue-character-system"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "3d-animation",
          + "ai-content",
          + "character-system",
          + "dialogue-generation",
          + "fastapi",
          + "llm",
          + "python",
          + "react",
          + "text-to-speech",
          + "typescript",
          + "voice-synthesis",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-github","PRNumber":1290,"Program":"tfcmt","SHA1":"35b4fd889df37c73c4a86202a35086f06500addd","Target":"repository","Vars":{},"WorkflowName":"Terraform - GitHub"} -->